Перем Форма1 Экспорт;
Перем ПолеВвода1;
Перем ПолеВвода2;
Перем ОбъектФорма;
Перем СохрТекст;

Процедура Кнопка1_Нажатие() Экспорт
	Сообщить("ЭтотОбъект = " + ЭтотОбъект);
	Сообщить("ЭтотОбъект.Форма1 = " + ЭтотОбъект.Форма1);
	Сообщить("ПолеВвода1 = " + ПолеВвода1);
	Сообщить("ПолеВвода2 = " + ПолеВвода2);
	Сообщить("ПолеВвода1.Имя = " + ПолеВвода1.Имя);
	Сообщить("ПолеВвода2.Имя = " + ПолеВвода2.Имя);
	Имя1 = ПолеВвода1.Имя;
	Имя2 = ПолеВвода2.Имя;
	Сообщить("ЭтотОбъект.Форма1.НайтиЭлемент(Имя1).Текст = " + ЭтотОбъект.Форма1.НайтиЭлемент(Имя1).Текст);
	Сообщить("ЭтотОбъект.Форма1.НайтиЭлемент(Имя2).Текст = " + ЭтотОбъект.Форма1.НайтиЭлемент(Имя2).Текст);
	ОбъектФорма = ЭтотОбъект.Форма1;
	Сообщить(ОбъектФорма);
	Сообщить("ОбъектФорма.ЭлементыУправления = " + ОбъектФорма.ЭлементыУправления);
	Сообщить("ОбъектФормы.ЭлементыУправления.Количество = " + ОбъектФорма.ЭлементыУправления.Количество);
	
	Для Индекс = 0 По ОбъектФорма.ЭлементыУправления.Количество - 1 Цикл
		Сообщить("ОбъектФорма.ЭлементыУправления.Элемент(" + Индекс + ") = " + ОбъектФорма.ЭлементыУправления.Элемент(Индекс));
	КонецЦикла;
	
	Эл1 = ЭтотОбъект.Форма1.НайтиЭлемент(Имя1);
	Эл2 = ЭтотОбъект.Форма1.НайтиЭлемент(Имя2);
	Сообщить("Эл1.Текст = " + Эл1.Текст);
	Сообщить("Эл2.Текст = " + Эл2.Текст);
	СохрТекст = Эл1.Текст;
	Эл1.Текст = Эл2.Текст;
	Эл2.Текст = СохрТекст;
	Сообщить("Эл1.Текст = " + Эл1.Текст);
	Сообщить("Эл2.Текст = " + Эл2.Текст);
КонецПроцедуры

ПодключитьВнешнююКомпоненту("/home/durtanyan/OneScriptForms/OneScriptForms.dll");
Ф = Новый ФормыДляОдноСкрипта();
Форма1 = Ф.Форма();
Форма1.Текст = "Тест библиотеки OneScriptForms";
Форма1.Высота = 500;
Форма1.Ширина = 500;
Форма1.Отображать = Истина;
Форма1.Показать();
Форма1.Активизировать();

Кнопка1 = Форма1.ЭлементыУправления.Добавить(Ф.Кнопка());
Кнопка1.Границы = Ф.Прямоугольник(10, 10, 200, 25);
Кнопка1.Текст = "Нажми меня";
Кнопка1.Нажатие = Ф.Действие(ЭтотОбъект, "Кнопка1_Нажатие");

ПолеВвода1 = Форма1.ЭлементыУправления.Добавить(Ф.ПолеВвода());
ПолеВвода1.Границы = Ф.Прямоугольник(10, 45, 200, 20);
ПолеВвода1.Имя = "ПолеВвода1";
ПолеВвода1.Текст = "ИмяПолеВвода1";

ПолеВвода2 = Форма1.ЭлементыУправления.Добавить(Ф.ПолеВвода());
ПолеВвода2.Границы = Ф.Прямоугольник(10, 75, 200, 20);
ПолеВвода2.Имя = "ПолеВвода2";
ПолеВвода2.Текст = "ИмяПолеВвода2";

Ф.ЗапуститьОбработкуСобытий();